// 도깨비 PJ 메인 페이지 JS - main.js //


/////////////////////// 로드 구역 ///////////////////////////
window.addEventListener("DOMContentLoaded", ()=>{
    
    console.log("로딩 완료!");

    // 구현내용 : 내부링크 클릭하여 index페이지 이동시, 파라미터로 구분해서 메인 페이지의 애니메이션 중지시키려고 함

    // 1.파라미터 읽어오기
    let pm = location.href;
    
    // 2.파라미터 유무로 분기하기
    // 물음표 존재 여부로 애니메이션 실행가부 결정하기
    if(pm.indexOf("?") !== -1) {

        // 파라미터 잘라서 값만 추출하기
        pm = pm.split("?")[1].split("=")[1];
        // 확인해보기
        console.log("파라미터값: ", pm);

        // pm값이 "m"이면 애니메이션 중지!
        if(pm === "m"){

            // body의 클래스를 제거하여, 애니메이션 중지시킴
            document.body.classList.remove("on");
        } /////////////////// if문 끝 //////////////////////
    } ///////////////////////////// if문 끝 ///////////////////////////////
    

}); ///////////////////////// 로드 구역 ///////////////////////////////