// 영화정보 객체 JS : JS4-1.배열과객체_object.js

// 성해초이스
var shObj = {
    // 1. 영화제목
    제목:"스위치",

    // 2. 감독
    감독:"마대윤",

    // 3. 배우
    배우:"권상우,오정세",

    // 4. 장르
    장르:"로맨스코미디",

    // 5. 관람가
    관람가:"12세 관람가",

    // 6. 예고편
    예고편: function(){
        // 1. 호출확인
        // alert("예고편");

        // 플레이함수 호출
        playMv("O_b5ZuETlCY");

    } //// 예고편 메서드 /////
}; /////////////////// shObj 객체 ////////////////\


// 민경초이스
var mkObj={
    // 1. 영화제목
    제목:"영웅",
    // 2. 감독
    감독:"윤제균",
    // 3. 배우
    배우:"정성화, 김고은, 나문희",
    // 4. 장르
    장르:"드라마",
    // 5. 관람가
    관람가:"12세 관람가",
    // 6. 예고편
    예고편:function(){
        // 1. 호출확인
        // alert("예고편");

        // 플레이함수 호출
        playMv("K4KR4J-yBMw");

    }///예고편 메서드////
};////mkObj 객체////

// 지은초이스
var jObj = {
    // 1.영화제목
    제목: "포레스트 검프",
    // 2. 감독
    감독: "로버트 저메키스",
    // 3. 배우
    배우: "톰 행크스",
    // 4. 장르
    장르: "드라마,코미디",
    // 5. 관람가
    관람가: "12세 관람가",
    // 6. 예고편
    예고편: function () {
        // 1. 호출확인
        // alert("예고편");

        // 플레이함수 호출
        playMv("wM67yX1-0NI");

    }, ///// 예고편 메서드 ////
}; ///////////// tomObj 객체 //////////////

// 소미초이스

var somObj = {
    // 1. 영화제목
    제목:"젠틀맨",
    // 2. 감독
    감독:"김경원",
    // 3. 배우
    배우:"주지훈,박성웅,최성은",
    // 4. 장르
    장르:"범죄",
    // 5. 관람가
    관람가:"15세 관람가",
    // 6. 예고편
    예고편: function(txt){
        // 1. 호출확인
        // alert("예고편");

        // 플레이함수 호출
        playMv("LL2uXeYeM-4");

    } ///////////////// 예고편 메서드
}; ///////////////////////////////// somObj 객체


// 해원초이스
var seoObj = {
    // 1. 영화제목
    제목: "더 퍼스트 슬램덩크",
    //2. 감독
    감독: "이노우에 다케히코",
    //3. 배우
    캐릭터: "송태섭",
    // 4. 장르
    장르: "만화",
    // 5. 관람가
    관람가: " 12세 관람가",
    // 6. 예고편
    예고편: function () {
        // 1. 호출확인
        //  alert("예고편");

        //플레이 함수 호출
        playMv("uJegwq2rMSs");

    }, // 예고편 메서드 ////
}; //////seo 객체 //////////////////


