// 뷰JS 데이터처리 뷰엑스 스토어 JS - vuedata-store.js

////////////////////////////// 😊뷰엑스 스토어를 활용한 변수 세팅하기😊 /////////////////////////////////////
// 1.뷰엑스 스토어 인스턴스를 생성한다
const store = new Vuex.Store({
    // (1)데이터 세팅 구역
    state:{

    }, /////////// state 구역 ///////////
    // (2)데이터 변경 메서드 구역 : 호출시 commit() 사용!
    mutations:{

    },
    // (3)백엔드 관련 코딩 비동기 처리 메서드 구역 : 호출시 dispatch() 사용!
    actions:{

    },
    
}); /////////////////////////// 뷰엑스 스토어 인스턴스 /////////////////////////////////////


// 내보내기
export default store;