// 뷰엑스 스토어 구현 JS - vuex-set.js



// 1.상단영역 컴포넌트 세팅 ////////////////////////////////
Vue.component("top-area", {
    template:``,
    data(){
        return{}
    },
    methods:{
        
    }
}); //////////////// 상단영역 컴포넌트 //////////////////



// 2.메인영역 컴포넌트 세팅 ////////////////////////////////
Vue.component("main-area", {
    template:``,
    data(){
        return{}
    },
    methods:{

    }
}); //////////////// 메인영역 컴포넌트 //////////////////



// 3.하단영역 컴포넌트 세팅 ////////////////////////////////
Vue.component("info-area", {
    template:``,
    data(){
        return{}
    },
    methods:{

    }
}); //////////////// 하단영역 컴포넌트 //////////////////





